{
  "title": "Roadmap",
  "pageBlocks": [
    {
      "titleBeforeRotate": "EagleEye Roadmap",
      "byLine": "Welcome to EagleEye's {public roadmap}! This is a live document and will be updated regularly",
      "_template": "hero"
    },
    {
      "title": "Recently Released",
      "items": [
        {
          "title": "Microsoft Graph Integration",
          "description": "Enable seamless access to Microsoft 365 data, allowing EagleEye to scan emails nightly, extract insights, and enhance tagging accuracy based on structured communication data from Outlook and other Microsoft services.",
          "badge": "✅ Live"
        },
        {
          "title": "Synchronization of historical data",
          "description": "Implement a historical data sync feature to allow users to analyze past email trends, providing deeper insights into communication patterns and workload distribution",
          "badge": "✅ Live"
        },
        {
          "title": "Customer Portal",
          "description": "Develop a self-service portal where customers can access Power BI reports for email insights, manage tags for better categorization, and track email synchronization jobs.",
          "badge": "✅ Live"
        }
      ],
      "_template": "Timeline"
    },
    {
      "title": "In Progress",
      "items": [
        {
          "title": "Customer Instance Setup \t",
          "description": "Automate the provisioning of dedicated EagleEye instances for customers, ensuring secure data isolation, streamlined onboarding, and customized configurations for enterprise users.\t\n",
          "badge": "In Progress"
        }
      ],
      "_template": "Timeline"
    },
    {
      "title": "Coming Soon",
      "items": [
        {
          "title": "GitHub Integration \t",
          "description": "Integrate with GitHub to analyze email discussions related to pull requests, issues, and code reviews, helping teams optimize collaboration and workflow efficiency.\t\n",
          "badge": "Coming Soon"
        },
        {
          "title": "Teams Integration ",
          "description": "Enable Microsoft Teams integration to analyze chat-based communications alongside email insights, providing a holistic view of team collaboration and workload balance",
          "badge": "Coming Soon"
        },
        {
          "title": "Email Response Time Analytics",
          "description": "Implement analytics to track and visualize email response times, helping organizations identify bottlenecks, improve communication efficiency, and enhance customer support effectiveness. ",
          "badge": "Coming Soon"
        }
      ],
      "_template": "Timeline"
    }
  ]
}